#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>
//初识变量的作用域和生命周期

//作用域的概念
//局部变量的作用域：就是变量所在的局部范围可以使用
//全局变量的作用域：整个工程

//int main()
//{
//	int a = 10;
//	printf("a=%d\n", a);
//	{
//		int b = 1;								//该变量只作用于这个{}内，printf("b=%d\n", b);无法输出b=1
//	}
//	printf("b=%d\n", b);
//	return 0;
//}

//声明一下全局变量，extern
//extern int jonsson;							//在整个工程中的其他源文件中，已经有这个全局变量，在此使用时需要声明一下变量
//int main()
//{
//	printf("%d\n", jonsson);
//}

//变量的生命周期：变量的创建和销毁之间的时间段	
//局部变量的生命周期：进入作用域生命周期开始，出作用域生命周期结束
//全局变量的生命周期：整个程序的生命周期

//------------------------------------------------------------------------------------------------------------

//常量分为以下几种：
//1.字面常量
//2.const 修饰的常变量
//3.#define 定义的标识符常量
//4.枚举常量

//int main()
//{
	//1.字母常量

	/*
	3.14;
	10;
	'a';
	"abcde";*/


	//2.const 修饰的常变量

	//const int num = 1;					//num就是常变量 - 具有常属性（不能被改变的属性）
	//num = 2;								//左值被指定为const 对象，不能被修改 会报错
	//printf("num=%d\n", num);

	//int hkdl[10] = { 0 };					//10个元素
	//int n = 10;
	//int hkdl2[n] = { 0 };					//n是个变量，这里是不行的
	//const int m = 10;
	//int hkdl3[m] = { 0 };					//即使m被const修饰为常变量，也是不行的，m的本质还是变量


	//3.#define 定义的标识符常量

//#define max 1000							//#define在{}内外都行,定义max=1000
//	max = 2000;								//err， max已经被定义
//	int n = max;
//	printf("n=%d\n", n);
//	return 0;
//}


//4.枚举常量 - 可以一一列举的常量
//enum - 枚举关键字
//enum Sex
//{
//	//这种枚举类型的变量的未来可能取值
//	//枚举常量
//	MALE=3,									//附初值，初值默认是0
//	FEMALE,
//	SECRET
//};
//
//int main()
//{
//	enum Sex x = MALE;
//	//MALE = 3；							//err 不能再这里修改，可以在enum 修改
//	printf("%d\n", MALE);					//输出值为0
//	printf("%d\n", FEMALE);					//输出值为1
//	printf("%d\n", SECRET);					//输出值为2
//}

//------------------------------------------------------------------------------------------------------------

//字符串就是一串字符--用双引号括起来的一串字符
//字符串的结束标志是一个\0的转义字符， 不算作字符串内容
//int main()
//{
//	"hello";
//	"abcde\n";
//	return 0;
//}

//#include <string.h>						//strlen 需要引用的头文件
//int main()
//{
//	//字符数组 - 数组是一组同类型的元素
//	//char add[] = "hello";					//字符串在结尾的位置隐藏了一个\0的字符
//	char add1[] = "abc";					//实际字符串内容  "abc\0" ，监视add1的类型为 char[4]
//	char add2[] = { 'a', 'b', 'c' };		//监视add2的类型为 char[3]
//	//char add3[] = { 'a', 'b', 'c', '\0'};
//	//printf("%s\n", add1);
//	//printf("%s\n", add2);
//
//	//求字符串长度
//	strlen("abc");							//string length
//	int len = strlen("abc");
//	printf("%d\n", len);					//\0是存在字符串内容中的，但是计算长度时 不算在内
//	int len1 = strlen(add1);
//	int len2 = strlen(add2);
//	printf("%d\n", len1);					//3
//	printf("%d\n", len2);					//15 因为改数组没有'\0'结束标志，得出的结果是一个 随机值
//	return 0;
//}

//------------------------------------------------------------------------------------------------------------

